#+TITLE: Filedesless' Emacs Configuration
#+OPTIONS: toc:3

*** Interactive Haskell Mode
    Gives a Haskell REPL when editing haskell files
    #+BEGIN_SRC emacs-lisp
      (require 'haskell-interactive-mode)
      (require 'haskell-process)
      (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
      ;'(haskell-process-type (quote cabal-new-repl))
    #+END_SRC

    #+RESULTS:
    | haskell-process-type | (quote cabal-new-repl) |

